

                                                        Hyun-Kook Kahng 
   Internet Draft                                          Jin Woo Jung 
   Document: draft-kahng-rss-mipv4-00.txt               Jung Hoon Cheon 
                                                       Korea University 
   Expires: 2002                                              July 2001 
 
 
                 Redirect Subnet Switching in Mobile IPv4 
                      <draft-kahng-rss-mipv4-00.txt> 
                    
Status of this Memo 
 
   This document is an Internet-Draft and is in full conformance with 
   all provisions of Section 10 of RFC2026 except that the right to 
   produce derivative works is not granted. 
    
   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups. Note that other 
   groups may also distribute working documents as Internet-Drafts. 
    
   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time.  It  is  inappropriate  to  use  Internet-Drafts  as  reference 
   material or to cite them other than as "work in progress."
    
   The list of current Internet-Drafts can be accessed at 
        http://www.ietf.org/ietf/1id-abstracts.txt 
   The list of Internet-Draft Shadow Directories can be accessed at 
        http://www.ietf.org/shadow.html. 
    
    
Abstract 
    
   From a viewpoint of a layer architecture, a network layer should 
   feature a mobility support. Then the users can enjoy their mobility 
   whatever data-link devices and user applications they use. 
    
   Mobile IP has been proposed for a solution to provide IP-layer 
   handoffs between subnets served by different Foreign Agents. However, 
   it still suffers an interruption of the communications for real-time 
   applications. 
    
   In certain cases, the latency involved in these handoffs can be above 
   the threshold required the support of delay-sensitive or real-time 
   services. The aim of this document is to present a move detection 
   mechanism to achieve low-latency Mobile IP handoffs. The described 
   techniques allow greater support for real-time services on a Mobile 
   IPv4 network by minimizing the period of time when a Mobile Node is 
   unable to send or receive IP packets due to the delay in the mobile 
   IPv4 move detection. 
    
   The next-generation of mobile communication networks will have higher 
   transmission rates and radio frequencies, smaller cell sizes and a 
   greater number of cells. When switching cells, mobile node(MN) must 
     
   KOREA University                                            [Page1] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
   have an efficient IP-based handoff scheme that handle switching 
   between  subnets  of  different  characteristics.  However,  current 
   wireless links and Mobile IPv4 protocols work independently, and this 
   causes problems. 
    
   Also, A subnet MAY contain several cells. For this case, the mobile 
   node MUST not change its IP address. This document specifies the move 
   detection on layer 3, which is independent of the move detection on 
   layer 2.  
 
 
Table of Contents 
    
   Status of this Memo................................................1 
   Abstract...........................................................1 
   1. Introduction....................................................3 
   1.1 Requirements...................................................4 
   1.2 Terminology....................................................4 
   1.3 Overview.......................................................5 
   1.4 Requirement Languages..........................................5 
   2. Redirect Subnet Switching Method................................6 
   2.1 General Redirect Subnet Switching Method.......................6 
   2.2 Problems.......................................................8 
   2.3 Combined the Redirect Subnet Switching with LCS(Lazy Cell 
   Switching).........................................................8 
   3. Redirect Route Setup Message...................................11 
   References........................................................13 
   Author's Addresses................................................14 
     
   Korea University                                            [Page2] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
    
1. Introduction 
    
   Mobile IPv4 has been proposed for a solution to provide IP-layer 
   handoffs between subnets served by different Foreign Agents(FAs). 
   However, it still suffers an interruption of the communications for 
   real-time applications. 
    
   In certain cases, the latency involved in these handoffs can be above 
   the threshold required the support of delay-sensitive or real-time 
   services. The aim of this document is to present a move detection 
   mechanism to achieve low-latency Mobile IPv4 handoffs. The described 
   techniques allow greater support for real-time services on a Mobile 
   IPv4 network by minimizing the period of time when a Mobile Node is 
   unable to send or receive IP packets due to the delay in the Mobile 
   IP move detection. 
    
   The next-generation of mobile communication networks will have higher 
   transmission rates and radio frequencies, smaller cell sizes and a 
   greater number of cells. When switching cells, Mobile Node(MN) must 
   have an efficient IP-based handoff scheme that handle switching 
   between  subnets  of  different  characteristics.  However,  current 
   wireless links and Mobile IPv4 protocols work independently, and this 
   causes problems. 
    
   In the absence of a communication between the link and IP layers that 
   would enable a Mobile Node to forecast an upcoming hand-off, Mobile 
   IPv4  has  to  rely  on  alternative  means  to  detect  movement[1]. 
   Specifically, every Mobility Agent is required to advertise its 
   existence  and  all  available  care-of  addresses  in  fixed  period 
   intervals. A Mobile Node entering a new subnet will detect its 
   movement by receipt of an "unknown" advertisement.  
   As such, a Mobile Node entering a network with multiple advertising 
   agents  may  be  prone  to  performing  several  handoffs  prior  to 
   reestablishing network connectivity. In certain cased, the latency 
   involved in these methods can be above the threshold required for the 
   support of delay-sensitive or real-time services. 
    
   This document specified the new method that provides the shortest 
   move detection for faster handoff. The presented techniques allow 
   greater support for real-time services on a Mobile IPv4 network by 
   minimizing the period of time when a MN is unable to send or receive 
   IP packets due to the delay in the Mobile IPv4 move detection. 
    
   Proposed method is based on strict source route option of IP version 
   4[2]. The strict source route option provides a means for the source 
   of IP datagram to supply routing information to be used by the 
   gateways in forwarding the datagram to the destination. If datagarm 
   is not passed specified route, Network Node sends ICMP error message 
   to source node of IP dataram. 
    
    
     
   Korea University                                            [Page3] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
1.1 Requirements 
   The following requirements are applicable to low-latency handoff 
   techniques and are supported by the methods in this document: 
    
      - provide low-latency and low loss handoff for real time services, 
     
      - have not dependence on a wireless layer 2 technology, 
    
      - reduce the effect of TCP performance. 
    
      - limit wireless bandwidth usage. 
    
1.2 Terminology 
    
   This section presents a few terms used through the document. 
    
   Binding 
        The association of a home address with a care-of address , along 
        with the remaining lifetime of that association. 
    
   CN 
        Specified in RFC 2002[1]. 
    
   COA 
        Specified in RFC 2002[1]. 
    
   Default Home Router(DHR) 
        Router is nearest to MN on Home Network. 
    
   Default Foreign Router(DFR) 
        Router is nearest to MN on Foreign Network. 
    
   Foreign Agent 
        Specified in RFC 2002[1]. 
    
   Home Agent 
        Specified in RFC 2002[1]. 
    
   Link-Layer Address 
        The address used to identify an endpoint of some communication 
        over a physical link. Typically, the Link-Layer address is an 
        interface's Media Access Control(MAC) address. 
    
   Modified Datagram  
        Datagram with using the strict source route option. 
    
   Node 
        Host or Router. 
    
   Redirect Subnet Switching(RSS) 
        This method is based on the characteristic of IP option. 
    
   Subnet 
     
   Korea University                                            [Page4] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
        MAY contain several Cells. 
 
 
1.3 Overview 
    
   Mobile IPv4 was originally designed without any assumptions about the 
   underlying link layers over which it would operate so that it could 
   have the widest possible applicability. 
    
   This approach has the advantage of facilitating a clean separation 
   between Layer 2 and Layer 3 of the protocol stack, but it has 
   negative consequences for handoff latency. 
    
   In  the  field  of  wireless  communications,  mobility  is  usually 
   understood as low-level mobility, that is the movement of a mobile 
   node between base stations(BSs) and the relative wireless handoff 
   mechanism which occurs as a result. The term low-level mobility 
   denotes node mobility that is handled by the MAC and its support for 
   roaming.  Its  aim  is  to  establish  and  maintain  reliable  link 
   connectivity despite node movement and loss nature of the wireless 
   medium.  
    
   Low-level mobility would involve the mobile node leaving the region 
   of coverage of the BS in subnet A, entering the region of coverage of 
   the BS in subnet B and registering with it at link layer level. 
   However, when considering a mobile IP network it is necessary to 
   define another type of mobility, namely high-level mobility. High-
   level mobility occurs at the IP(i.e. Mobile IP)level. This involves 
   the Mobile IPv4 move detection method, which enable a mobile node to 
   take decisions on whether it should switch between agents. This is 
   not normally dependent on low-level mobility, although low-level 
   mobility must precede high-level mobility. 
    
   This document assumed that the underlying link layer connection is 
   already established, and the layer 3 cannot use the function of layer 
   2. Therefore, this document is specified under the assumption that 
   the  technique  on  layer  3  is  independent  of  the  technique  on 
   underlying layer 2 for providing move detection. 
    
   Redirect Subnet Switching mechanism is based on the characteristic of 
   strict source route option. When mobile node(MN) sends every packet 
   to correspondent node(CN), MN's IP output function MUST always set up 
   the strict source routing option. Therefore, when MN moves from one 
   subnet to another subnet, the address of MN's default router is 
   changed, and resulting in redirect route setup message sent to MN 
   from network node. 
    
    
1.4 Requirement Languages 
    
   In this document, the key words "MAY", "MUST", "MUST NOT", "optional", 
   "recommended", "SHOULD", and "SHOULD NOT", are to be interpreted as 
   described in [3]. 
     
   Korea University                                            [Page5] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
2. Redirect Subnet Switching Method 
    
2.1 General Redirect Subnet Switching Method 
 
   The RSS method is based on the characteristic of the strict source 
   route option. When MN sends every packet to correspondent node, MN's 
   IP function has to always set up the strict source route option. 
   Therefore, when MN moves from one subnet to another subnet, the 
   address of default router is changed, and resulting in a redirect 
   route setup message sent to MN. The MN performs move detection upon 
   receipt of redirect route setup message and, if appropriate, it sends 
   a  Registration  Request  Message[1]  to  default  foreign  router 
   requesting a simultaneous binding. 
 
   The basic RSS mechanism is summarized in Figure 1: 
                                              
         +------------------------------+---------------------------+ 
   +----+| +---------------+ +----+     |        +----------------+ | 
   | CN || | Default Home  | | MN |     |        |Default Foreign | | 
   +--+-+| | Router (DHR)  | +-+--+     |+----+  |Router (DFR)    | | 
      |  | +-------+-------+   |        || MN |  +--------+-------+ | 
   +--+--+---------+-----------+--+     |+-+--+           |         | 
   |Communicating with modified   |     |  |              |         | 
   |Datagram                      |     |  |              |         | 
   +--+--+---------+-----------+--+     |  |              |         | 
      |  |         |           | Moving |  |              |         | 
      |  |         |           |--------+->|  1.Modified  |         | 
      |  |         |           |        |  |    Datagram  |         | 
      |  |         |           |        |  |------------->|         | 
      |  |         |           |        |  |  2.Redirect  |         | 
      |  |         |           |        |  | Route Setup  |         | 
      |  |         |           |        |  |<-------------|         | 
      |  |         |           |        |  |              |         | 
      |  |         |           |        |  |3.Reg. Request|         | 
      |  |         |           |        |  |------------->|         | 
      |  |         | Registrion| Request|  |              |         | 
      |  |         |<----------+--------+--+--------------|         | 
      |  |         | Registrion| Reply  |  |              |         | 
      |  |         |-----------+--------+--+------------->|         | 
      |  |         |           |        |  | Reg. Reply   |         | 
      |  |         |           |        |  |<-------------|         | 
         |          Home Domain         |      Foreign Domain       | 
         +------------------------------+---------------------------+ 
                       Figure 1. General RSS Handoff 
 
    
   Following steps provide more detail on this mechanism: 
    
   1. MN sends modified datagram with the strict source route option. 
   2. If Default Foreign Router is acts as Mobility Agent, Default 
      Foreign  Router sends a Redirect Route Setup Message to MN. 
   3. Then, the MN performs move detection upon receipt of the Redirect 
      Route Setup Message and, if appropriate, it sends a Registration 
     
   Korea University                                            [Page6] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
      Request  message[1]  to  Foreign  Default  Router  requesting  a 
      simultaneous binding. 
    
   Figure 1 specified the general RSS handoff. Because MN transmits 
   packets, which involve strict source route option, the Foreign 
   Default Router reply with a Redirect Router Setup Message.  
    
   When MN receives this message from router that takes the place of 
   mobile  agent  function,  this  message  is  similar  to  the  agent 
   advertisement message of Mobile IPv4. But, we modified the means of 
   header  fields  in  the  Agent  Advertisement  message  for  RSS[1].: 
   Redirect Route Setup Message(see Section 3). The MN that received 
   redirect route setup message sends registration request message to 
   the address of FA, which is extracted from the agent advertisement 
   message. 
    
   But, if Default Foreign Router does not act as mobility Agent, 
   following procedures are adapted. When MN is received a redirect  
   route setup message from router that does not take the place of agent 
   function, this redirect route setup message does not contain the 
   location information of agent: generic ICMP error message(see RFC 
   777[7]). 
    
   The RSS mechanism for the case that Default Router dose not act 
   mobile agent is summarized in Figure 2: 
    
         +------------------------------+---------------------------+ 
   +----+| +---------------+ +----+     |        +----------------+ | 
   | CN || | Default Home  | | MN |     |        |Default Foreign | | 
   +--+-+| | Router (DHR)  | +-+--+     |+----+  |Router (DFR)    | | 
      |  | +-------+-------+   |        || MN |  +--------+-------+ | 
   +--+--+---------+-----------+--+     |+-+--+           |         | 
   |  Communicating with modified |     |  |              |         | 
   |  Datagram                    |     |  |              |         | 
   +--+--+---------+-----------+--+     |  |              |         | 
      |  |         |           | Moving |  |              |         | 
      |  |         |           |--------+->|   Modified   |         | 
      |  |         |           |        |  |   Datagram   |         | 
      |  |         |           |        |  |------------->|         | 
      |  |         |           |        |  |Original ICMP |         | 
      |  |         |           |        |  |Error Message |         | 
      |  |         |           |        |  |<-------------|         | 
      |  |         |           |        |  |    Agnet     |         | 
      |  |         |           |        |  | Solicitation |         | 
      |  |         |           |        |  |   Message    |         | 
      |  |         |           |        |  |------------->|         | 
      |  |         |           |        |  |    Agent     |         | 
      |  |         |           |        |  | Advertisement|         | 
      |  |         |           |        |  |   Message    |         | 
      |  |         |           |        |  |<-------------|         | 
      |  |         |           |        |  | Registration |         | 
      |  |         |           |        |  |    Request   |         | 
      |  |         | Registrion| Request|  |              |         | 
     
   Korea University                                            [Page7] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
      |  |         |<----------+--------+--+--------------|         | 
      |  |         | Registrion| Reply  |  |              |         | 
      |  |         |-----------+--------+--+------------->|         | 
      |  |         |           |        |  | Reg. Reply   |         | 
      |  |         |           |        |  |------------->|         | 
         |          Home Domain         |      Foreign Domain       | 
         +------------------------------+---------------------------+ 
     Figure 2. The case that Default Router dose not act mobile agent 
    
   This method is useful in case that mobile agent does not exist on 
   subnet after MN moves. In this case(does not exist FA), when MN 
   receives a Original ICMP error message, MN may alternatively operate 
   Foreign Agents by replacing them with a dynamic host configuration 
   service(DHCP). Then, MN sends registration request message with using 
   allocated CCOA to HA. 
    
   Following steps provide more detail when dose not exist Foreign 
   Agent: 
    
   1. MN sends modified datagram with strict source route option. 
   2. If Default Foreign Router does not act as Mobility Agent, Foreign 
      Default Router sends ICMP error message to the MN. 
   3. The MN performs move detection upon receipt of ICMP error message 
      and, if appropriate, it triggers the procedure by using DHCP.  
   4. If the MN obtains CCOA in successful, it sends registration 
      request message with using allocated CCOA to HA. 
    
   In  this  document,  a  agent  advertisement  message  is  sent  by 
   broadcasting, this method can compensate the move detection during MN 
   does not send packet. But, any network which does not support 
   broadcast cannot compensate the movement during MN does not send 
   packet. For this case, this mechanism needs to additional method of 
   upper layer(i.e. HeartBeat). 
    
    
2.2 Problems 
    
   General Redirect Subnet Switching has two critical problems: RSS have 
   a overhead-per-datagram(i.e.   for   Ethernet   link,   0.8   % 
   overhead/datagram. 12/1500), and cannot achieve move detection when MN 
   does not send datagram. 
   The overhead-per-datagram can be reduced with limited RSS. The 
   limited RSS specifies that the first datagram of full data only 
   contains the strict source route option. 
    
    
2.3 Combined the Redirect Subnet Switching with LCS(Lazy Cell Switching) 
 
   In section 2.2, we specified two problems. In this section, we 
   suggest improved RSS combined with LCS in Mobile IPv4[1] for solving 
   the second problem of RSS. 
    
     
   Korea University                                            [Page8] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
   The LCS method for move detection is based upon the Lifetime field 
   within the main body of the ICMP Router Advertisement portion of the 
   agent advertisement. Therefore, this method relies on the interval of 
   agent advertisement. Otherwise, RSS relies on the transmission rate 
   of MN. So, we propose improved RSS, which is based on LCS for 
   compensating the disadvantage of RSS 
    
   The overall improved RSS move detection method is summarized in 
   Figure 3: 
         -------------------------------+--------------------------- 
   +----+| +---------------+ +----+     |        +----------------+ | 
   | CN || | Default Home  | | MN |     |        |Default Foreign | | 
   +--+-+| | Router (DHR)  | +-+--+     |+----+  |Router(DFR)     | | 
      |  | +-------+-------+   |        || MN |  +--------+-------+ | 
   +--+--+---------+-----------+--+     |+-+--+           |         | 
   |Communicating with modified   |     |  |              |         | 
   |Datagram                      |     |  |              |         | 
   +--+--+---------+-----------+--+     |  | 1.FDR's Agent|         | 
      |  |         |           |        |  | Advertisement|         | 
      |  |         |           |        |  |<-------------|<-+      | 
      |  |         |           |        |  | 2.Modified   |  |      | 
      |  |         |           |        |  | Datagram     |  |      | 
      |  |         |           |        |  |------------->|  X      | 
      |  |         |           |        |  |      :       |  |      | 
      |  |         |           | Moving |  | 2.Modified   |  |      | 
      |  |         |           |--------+->| Datagram     |  |      | 
      |  |         |           |        |  |------------->|<-+      | 
      |  |         |           |        |  | 3. Redirect  |         | 
      |  |         |           |        |  | Route Setup  |         | 
      |  |         |           |        |  |<-------------|         | 
      |  |         |           |        |  | Registration |         | 
      |  |         |           |        |  | Request      |         | 
      |  |         |           |        |  |------------->|         | 
      |  |         |           |        |  | Registration |         | 
      |  |         |           |        |  | Request      |         | 
      |  |         |<----------+--------+--+--------------|         | 
      |  |         |           |        |  | Registration |         | 
      |  |         |           |        |  | Reply        |         | 
      |  |         |-----------+--------+--+------------->|         | 
      |  |         |           |        |  | Registration |         |  
      |  |         |           |        |  | Reply        |         | 
      |  |         |           |        |  |<-------------|         | 
      |  |         |           |        |  |              |         | 
         |          Home Domain         |      Foreign Domain       | 
         +------------------------------+---------------------------+ 
   X : The interval of Advertisement Message 
                          Figure 3. Improved RSS 
    
   The procedure of combined RSS with LCS is divided following steps:  
   1. Default Foreign Router sends periodically an agent advertisement 
      message. 
   2. When Mobile Node received the agent advertisements from any FA, 
      MN  SHOULD  record  the  Lifetime  received  in  any  agent 
     
   Korea University                                            [Page9] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
      advertisements, until that Lifetime expires. Then, MN sends 
      datagram with using the RSS method during the specified time(x of 
      Figure3). If MN does not have any sending data, MN SHOULD send 
      modified datagram with NULL data. 
   2b. If the MN fails to receive another advertisement from the same 
      agent within the specified Lifetime, it SHOULD assume that it has 
      lost contact with that agent. The MN SHOULD send datagram with 
      using the RSS method during specified time. If MN does not have 
      any sending data, MN SHOULD send modified datagram with NULL data. 
   3. When the MN receives Redirect Route Setup Message, it can achieve 
      move detection.  
   4. If the MN has previously received an Agent Advertisement from 
      another agent for which the Lifetime field has not yet expired, 
      the mobile node MAY cache agent advertisement of the agent. 
      Otherwise, the mobile node SHOULD extract a new agent from 
      Redirect Route Setup Message. 
 
   Because the mobility agents periodically send a advertisement message, 
   The Default Router on the subnet can intercept the advertisement 
   message, and MUST cache the location information of the mobility 
   agent. Therefore, this procedure is required to modify the function 
   of all network node(e.g., router, mobile node).  
    
     
   Korea University                                           [Page10] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
    
3. Redirect Route Setup Message 
    
   The Redirect Error Message is used to determine whether MN is 
   currently connected to its home network or to a foreign network, and 
   by which a mobile node can detect when it has moved from one network 
   to another.  
    
   In other words, because MN cannot directly send packets to default 
   router, MN must register current location to previous agent. 
   Redirect Error Message can be used for both error notification and 
   agent advertisement. If the node sending Redirect Error Message does 
   not know the location of agent, it only informs MN of MN's movement.  
   Otherwise, the node sending Redirect Error Message sends the message 
   that  contains  error  reporting  information  and  agent  location 
   information. 
    
   The RSS extends ICMP Router Discovery[4] as its primary mechanism for 
   move detection. The Redirect Route Setup Message is formed with 
   including the modification of agent advertisement in an ICMP Router 
   Advertisement message. 
     
      0                   1                   2                   3 
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Type      |     Code      |          Checksum             | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |   Num Addrs   |Addr Entry Size|          LifeTime             | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |              Agent or Router Address[1]...[n]                 | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                  Preference Level[1]...[n]                    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Extension ... 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Type      |    Length     |         Sequence Number       | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |     Registration Lifetime     |R|B|H|F|M|G|V|     Reserved    | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    |                Zero or more care-of address                   | 
    |                           ....                                | 
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
                   Figure 4. Redirect Route Setup Message 
     
   The mobile node uses these Redirect Error Message to determine their 
   current point of attachment to the Internet.  
    
   Within an Redirect Error Message, ICMP Router Advertisement fields of 
   the message are required to conform to the following additional 
   specifications: 
    
   - Link-Layer Fields 
       
     
   Korea University                                           [Page11] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
     Destination Address 
        The  link-layer  destination  address  of  mobile  node  that 
        transmitted packets through incorrect route list MUST be set. 
    
    
   - IP Fields 
     TTL  
        The TTL for all Redirect Route Setup Message MUST be set to 1. 
       Destination Address as specified for ICMP Router Discovery [4], 
       the IP destination address of an Redirect Route Setup message 
       MUST  be  either  the  "all  systems  on  this  link"  multicast 
       address(224.0.0.1)   or   the   "limited   broadcast"   address 
       (255.255.255.255). The subnet-directed broadcast address of the 
       form <prefix>.<-1> cannot be used since mobile nodes will not 
       generally know the prefix of the foreign network. 
    
   - ICMP Fields 
     
     Code 
        The Code field of Redirect Route Setup Message is interpreted as 
        follows: 
    
        1  The router only handles common traffic -- that is, it only 
           acts as router for IP datagram not necessarily related to 
           mobile  nodes.  Therefore,  the  Agent  or  Router  Address 
           Field[i] only contains router list. 
    
        32 The router acts as mobility agent -- that is, Agent or 
           Router Address field contains the list of mobility agent on 
           current subnet and the list of Default Router on current 
           subnet. 
    
     Lifetime 
           Specified in RFC 2002. 
    
     Agent or Router Address 
         
           These fields MAY contain one or more router addresses. If 
           the router acts as mobility agent, these fields MAY contain 
           mobility agent address as the last field and contain router 
           list on this subnet. Otherwise, these fields MAY contain the 
           list of router on this subnet. 
    
     Preference Level[i] 
           If the router of Agent or Router Address acts as mobility 
           agent, these fields MUST be set to 0. Otherwise, these 
           fields MAY be set to the preferability of each Agent or 
           Router Address[i] as a default router address, relative to 
           other router addresses on the same subnet. 
    
   The last part of Agent Advertisement is the same as specified in RFC 
   2002. 
     
   Korea University                                           [Page12] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
    
References 
   [1] C. Perkins, Editor, "IP Mobility Support", RFC 2002, October 1996. 
   [2] J. Postel, Editor, "Internet Protocol", STD 5, RFC 791, September 
   1981. 
   [3] S. Bradner, Editor, "Key words for use in RFCs to Indicate 
   Requirement Levels", BCP 14. RFC 2119. March 1997. 
   [4] S. Deering, Editor, "ICMP Router Discovery Messages", RFC 1256, 
   September 1991. 
   [5] S. Deering, Editor, "Host Extensions for IP Multicasting", STD 5, 
      RFC 1112, August 1989. 
   [6] Droms, R., "Dynamic Host Configuration Protocol", RFC 1541,     
      October 1993. 
   [7] J. Postel, Editor, "Internet Control Message Protocol", RFC 777, 
      April 1981. 
    
    
     
   Korea University                                           [Page13] 
    
   INTERNET-DRAFT      Redirect Subnet Switching             july 2001 
 
    
    
    
Author's Addresses 
    
   Jin Woo Jung 
   Korea University 
   Electronic Information Engineering  Phone:  +82-41-860-1424 
   Seoul, Korea                        Email:  grjjw@tiger.korea.ac.kr 
    
   Hyun Kook Kahng 
   Korea University 
   Electronic Information Engineering  Phone:  +82-41-860-1424 
   Seoul, Korea                        Email:  kahng@tiger.korea.ac.kr 
    
   Jung Hoon Cheon 
   Korea University 
   Electronic Information Engineering  Phone:  +82-41-860-1424 
   Seoul, Korea                        Email:  grcurly@tiger.korea.ac.kr 
    
    
    
     
   Korea University                                           [Page14] 